Repository: ShanePark/dutypark
Catalog: ios/Dutypark/Resources/Errors.xcstrings
Source language: en
Languages: es, ja, ko, zh_hans

# already_linked
source: This social account is already connected to another account.
es: Esta cuenta social ya está conectada a otra cuenta.
ja: このソーシャルアカウントはすでに別のアカウントに連携されています。
ko: 이미 다른 계정에 연결된 소셜 계정입니다.
zh_hans: 此社交账号已关联到其他账号。

# auth.oauth.mobile.authorizationUrl.invalid
source: Could not start social login. Please try again.
es: No se pudo iniciar el acceso social. Inténtalo de nuevo.
ja: ソーシャルログインを開始できませんでした。もう一度お試しください。
ko: 소셜 로그인을 시작하지 못했습니다. 다시 시도해주세요.
zh_hans: 无法启动社交账号登录，请重试。

# auth.oauth.mobile.callback.invalid
source: The social login response is invalid. Please try again.
es: La respuesta del acceso social no es válida. Inténtalo de nuevo.
ja: ソーシャルログインの応答が無効です。もう一度お試しください。
ko: 소셜 로그인 응답이 올바르지 않습니다. 다시 시도해주세요.
zh_hans: 社交账号登录响应无效，请重试。

# auth.oauth.mobile.callback.notAllowed
source: The social login callback address is not allowed.
es: La dirección de retorno del acceso social no está permitida.
ja: ソーシャルログインのコールバック先が許可されていません。
ko: 허용되지 않은 소셜 로그인 콜백 주소입니다.
zh_hans: 不允许使用此社交账号登录回调地址。

# auth.oauth.mobile.code.invalid
source: The social login code is invalid or expired. Please start again.
es: El código de acceso social no es válido o ha caducado. Vuelve a empezar.
ja: ソーシャルログインコードが無効か期限切れです。最初からやり直してください。
ko: 소셜 로그인 코드가 올바르지 않거나 만료되었습니다. 처음부터 다시 시도해주세요.
zh_hans: 社交账号登录代码无效或已过期，请重新开始。

# auth.oauth.mobile.pkce.invalid
source: Social login security verification failed. Please start again.
es: Falló la verificación de seguridad del acceso social. Vuelve a empezar.
ja: ソーシャルログインのセキュリティ確認に失敗しました。最初からやり直してください。
ko: 소셜 로그인 보안 확인에 실패했습니다. 처음부터 다시 시도해주세요.
zh_hans: 社交账号登录安全验证失败，请重新开始。

# auth.oauth.mobile.provider.invalid
source: This social login provider is not supported.
es: Este proveedor de acceso social no es compatible.
ja: このソーシャルログインには対応していません。
ko: 지원하지 않는 소셜 로그인 제공자입니다.
zh_hans: 不支持此社交账号登录提供商。

# auth.oauth.mobile.purpose.invalid
source: This social login request is not supported.
es: Esta solicitud de acceso social no es compatible.
ja: このソーシャルログイン要求には対応していません。
ko: 지원하지 않는 소셜 로그인 요청입니다.
zh_hans: 不支持此社交账号登录请求。

# auth.oauth.mobile.state.invalid
source: The social login session is invalid or expired. Please start again.
es: La sesión de acceso social no es válida o ha caducado. Vuelve a empezar.
ja: ソーシャルログインセッションが無効か期限切れです。最初からやり直してください。
ko: 소셜 로그인 세션이 올바르지 않거나 만료되었습니다. 처음부터 다시 시도해주세요.
zh_hans: 社交账号登录会话无效或已过期，请重新开始。

# provider_failed
source: The social login provider could not complete authentication. Please try again.
es: El proveedor de acceso social no pudo completar la autenticación. Inténtalo de nuevo.
ja: ソーシャルログインの認証に失敗しました。もう一度お試しください。
ko: 소셜 로그인 제공자 인증에 실패했습니다. 다시 시도해주세요.
zh_hans: 社交账号登录提供商未能完成认证，请重试。

# attachment.context.missing
source: Attachment context information is missing.
es: Falta la información del contexto del archivo adjunto.
ja: 添付ファイルのコンテキスト情報がありません。
ko: 첨부파일의 컨텍스트 정보가 없습니다.
zh_hans: 缺少附件上下文信息。

# attachment.extension.blocked
source: This file extension is not allowed.
es: Esta extensión de archivo no está permitida.
ja: 許可されていないファイル拡張子です。
ko: 허용되지 않는 파일 확장자입니다.
zh_hans: 不允许使用此文件扩展名。

# attachment.profile.forbidden
source: You do not have permission to modify this profile attachment.
es: No tienes permiso para modificar este archivo adjunto de perfil.
ja: このプロフィール添付ファイルを変更する権限がありません。
ko: 이 프로필 첨부파일을 수정할 권한이 없습니다.
zh_hans: 您无权修改此个人资料附件。

# attachment.session.auth.required
source: Login is required to access session attachments.
es: Es necesario iniciar sesión para acceder a los archivos adjuntos de la sesión.
ja: 一時アップロードセッションの添付ファイルにアクセスするにはログインが必要です。
ko: 임시 업로드 세션 첨부파일에 접근하려면 로그인이 필요합니다.
zh_hans: 需要登录才能访问会话附件。

# attachment.session.contextMismatch
source: The upload session does not match the target context.
es: La sesión de carga no coincide con el contexto de destino.
ja: アップロードセッションと対象コンテキストが一致しません。
ko: 업로드 세션과 대상 컨텍스트가 일치하지 않습니다.
zh_hans: 上传会话与目标上下文不匹配。

# attachment.session.forbidden
source: You do not have permission to access this upload session.
es: No tienes permiso para acceder a esta sesión de carga.
ja: このアップロードセッションにアクセスする権限がありません。
ko: 이 업로드 세션에 접근할 권한이 없습니다.
zh_hans: 您无权访问此上传会话。

# attachment.session.notFound
source: The upload session for this attachment could not be found.
es: No se pudo encontrar la sesión de carga de este archivo adjunto.
ja: この添付ファイルに紐づくアップロードセッションが見つかりません。
ko: 이 첨부파일에 연결된 업로드 세션을 찾을 수 없습니다.
zh_hans: 找不到此附件的上传会话。

# attachment.session.targetContext.missing
source: The upload session is missing target context information.
es: A la sesión de carga le falta información del contexto de destino.
ja: アップロードセッションに対象コンテキスト情報がありません。
ko: 업로드 세션의 대상 컨텍스트 정보가 없습니다.
zh_hans: 上传会话缺少目标上下文信息。

# attachment.size.exceeded
source: The file is too large.
es: El archivo es demasiado grande.
ja: ファイルサイズが大きすぎます。
ko: 파일 크기가 너무 큽니다.
zh_hans: 文件太大。

# attachment.todo.access.forbidden
source: You do not have permission to view this to-do attachment.
es: No tienes permiso para ver este archivo adjunto de tareas pendientes.
ja: このTo-do添付ファイルを閲覧する権限がありません。
ko: 이 할 일 첨부파일을 볼 권한이 없습니다.
zh_hans: 您无权查看此待办事项附件。

# attachment.todo.auth.required
source: Login is required to access this to-do attachment.
es: Es necesario iniciar sesión para acceder a este archivo adjunto de tareas pendientes.
ja: このTo-do添付ファイルにアクセスするにはログインが必要です。
ko: 이 할 일 첨부파일에 접근하려면 로그인이 필요합니다.
zh_hans: 需要登录才能访问此待办事项附件。

# attachment.todo.write.forbidden
source: You do not have permission to modify this to-do attachment.
es: No tienes permiso para modificar este archivo adjunto de tareas pendientes.
ja: このTo-do添付ファイルを変更する権限がありません。
ko: 이 할 일 첨부파일을 수정할 권한이 없습니다.
zh_hans: 您无权修改此待办事项附件。

# auth.impersonation.alreadyImpersonating
source: You are already impersonating another account.
es: Ya estás haciéndote pasar por otra cuenta.
ja: すでに別のアカウントに切り替え中です。
ko: 이미 다른 계정으로 전환된 상태입니다.
zh_hans: 您已经在冒充另一个帐户。

# auth.impersonation.failed
source: Failed to switch accounts.
es: No se pudo cambiar de cuenta.
ja: アカウント切り替えに失敗しました。
ko: 계정 전환에 실패했습니다.
zh_hans: 切换账户失败。

# auth.impersonation.forbidden
source: You do not have permission to manage this account.
es: No tienes permiso para administrar esta cuenta.
ja: このアカウントを管理する権限がありません。
ko: 관리 권한이 없습니다.
zh_hans: 您无权管理此帐户。

# auth.impersonation.managerNotFound
source: Manager account could not be found.
es: No se pudo encontrar la cuenta de administrador.
ja: 管理者アカウントが見つかりません。
ko: 관리자 계정을 찾을 수 없습니다.
zh_hans: 找不到经理帐户。

# auth.impersonation.targetNotFound
source: Target account could not be found.
es: No se pudo encontrar la cuenta de destino.
ja: 対象アカウントが見つかりません。
ko: 대상 계정을 찾을 수 없습니다.
zh_hans: 找不到目标帐户。

# auth.login.failed
source: Email or password is incorrect.
es: El correo electrónico o la contraseña son incorrectos.
ja: メールアドレスまたはパスワードが正しくありません。
ko: 이메일 또는 비밀번호가 올바르지 않습니다.
zh_hans: 电子邮件或密码不正确。

# auth.login.rateLimited
source: Too many login attempts. Please try again later.
es: Demasiados intentos de inicio de sesión. Inténtelo de nuevo más tarde.
ja: ログイン試行回数が多すぎます。しばらくしてから再試行してください。
ko: 로그인 시도 횟수를 초과했습니다. 잠시 후 다시 시도해 주세요.
zh_hans: 登录尝试次数过多。请稍后重试。

# auth.password.changeUnauthorized
source: You are not authorized to change this password.
es: No está autorizado a cambiar esta contraseña.
ja: このパスワードを変更する権限がありません。
ko: 이 비밀번호를 변경할 권한이 없습니다.
zh_hans: 您无权更改此密码。

# auth.password.currentMismatch
source: Current password does not match.
es: La contraseña actual no coincide.
ja: 現在のパスワードが一致しません。
ko: 현재 비밀번호가 일치하지 않습니다.
zh_hans: 当前密码不匹配。

# auth.password.memberNotFound
source: Account does not exist.
es: La cuenta no existe.
ja: アカウントが存在しません。
ko: 존재하지 않는 계정입니다.
zh_hans: 帐户不存在。

# auth.refresh.current.required
source: The current refresh token is required.
es: Se requiere el token de actualización actual.
ja: 現在のログインに使っているリフレッシュトークン情報が必要です。
ko: 현재 로그인 중인 리프레시 토큰 정보가 필요합니다.
zh_hans: 需要当前刷新令牌。

# auth.refresh.expired
source: Refresh token has expired.
es: El token de actualización ha caducado.
ja: リフレッシュトークンの有効期限が切れています。
ko: 리프레시 토큰이 만료되었습니다.
zh_hans: 刷新令牌已过期。

# auth.refresh.invalid
source: Invalid refresh token.
es: Token de actualización no válido.
ja: 無効なリフレッシュトークンです。
ko: 유효하지 않은 리프레시 토큰입니다.
zh_hans: 刷新令牌无效。

# auth.refreshToken.delete.forbidden
source: You do not have permission to delete this refresh token.
es: No tienes permiso para eliminar este token de actualización.
ja: このリフレッシュトークンを削除する権限がありません。
ko: 이 리프레시 토큰을 삭제할 권한이 없습니다.
zh_hans: 您无权删除此刷新令牌。

# auth.required
source: Login is required.
es: Es necesario iniciar sesión.
ja: ログインが必要です。
ko: 로그인이 필요합니다.
zh_hans: 需要登录。

# auth.restore.failed
source: Failed to restore the original account.
es: No se pudo restaurar la cuenta original.
ja: 元のアカウントへ戻れませんでした。
ko: 계정 복원에 실패했습니다.
zh_hans: 无法恢复原始帐户。

# auth.restore.notImpersonating
source: You are not currently impersonating another account.
es: Actualmente no estás haciéndote pasar por otra cuenta.
ja: 現在はアカウント切り替え状態ではありません。
ko: 전환된 계정 상태가 아닙니다.
zh_hans: 您当前没有冒充其他帐户。

# auth.restore.originalMissing
source: Original account information is missing.
es: Falta la información de la cuenta original.
ja: 元のアカウント情報がありません。
ko: 원래 계정 정보가 없습니다.
zh_hans: 原始帐户信息丢失。

# auth.restore.originalNotFound
source: Original account could not be found.
es: No se pudo encontrar la cuenta original.
ja: 元のアカウントが見つかりません。
ko: 원래 계정을 찾을 수 없습니다.
zh_hans: 找不到原始帐户。

# auth.token.memberNotFound
source: Account does not exist.
es: La cuenta no existe.
ja: アカウントが存在しません。
ko: 존재하지 않는 계정입니다.
zh_hans: 帐户不存在。

# auth.unauthorized
source: Unauthorized.
es: No autorizado.
ja: 認証が必要です。
ko: 인증이 필요합니다.
zh_hans: 未经授权。

# common.badRequest
source: Bad request.
es: Mala petición.
ja: 不正なリクエストです。
ko: 잘못된 요청입니다.
zh_hans: 不好的请求。

# common.concurrentUpdate
source: Another duty update is in progress. Please try again shortly.
es: Se está procesando otro cambio de turno. Inténtelo de nuevo en unos instantes.
ja: 別の勤務変更を処理中です。しばらくしてからもう一度お試しください。
ko: 다른 근무 변경이 처리 중입니다. 잠시 후 다시 시도해 주세요.
zh_hans: 其他排班更改正在处理中，请稍后重试。

# common.notFound
source: Resource not found.
es: Recurso no encontrado.
ja: リソースが見つかりません。
ko: 리소스를 찾을 수 없습니다.
zh_hans: 未找到资源。

# common.rateLimit.exceeded
source: Too many requests. Please try again later.
es: Demasiadas solicitudes. Inténtelo de nuevo más tarde.
ja: リクエストが多すぎます。しばらくしてから再試行してください。
ko: 요청이 너무 많습니다. 잠시 후 다시 시도해 주세요.
zh_hans: 请求太多。请稍后重试。

# common.validation.failed
source: Please check the request fields.
es: Por favor revise los campos de solicitud.
ja: リクエスト内容を確認してください。
ko: 요청 값을 다시 확인해 주세요.
zh_hans: 请检查请求字段。

# dday.access.forbidden
source: You do not have permission to access this D-Day.
es: No tienes permiso para acceder a este D-Day.
ja: このD-Dayにアクセスする権限がありません。
ko: 이 D-Day에 접근할 권한이 없습니다.
zh_hans: 您无权访问此 D-Day。

# dday.title.length
source: D-Day titles must be between 1 and 30 characters.
es: Los títulos D-Day deben tener entre 1 y 30 caracteres.
ja: D-Dayのタイトルは1文字以上30文字以下で入力してください。
ko: D-DAY 제목은 1자 이상 30자 이하로 입력해주세요.
zh_hans: D-Day 标题必须介于 1 到 30 个字符之间。

# dday.title.required
source: D-Day title is required.
es: Se requiere el título D-Day.
ja: D-Dayのタイトルは必須です。
ko: D-DAY 제목은 필수입니다.
zh_hans: D-Day 标题为必填项。

# duty.edit.forbidden
source: You do not have permission to edit this duty.
es: No tienes permiso para editar este turno.
ja: この勤務を編集する権限がありません。
ko: 이 근무를 수정할 권한이 없습니다.
zh_hans: 您无权编辑此班次。

# duty.pattern.dutyType.invalid
source: The selected duty type is unavailable. Check the team settings.
es: El tipo de turno seleccionado no está disponible. Revisa la configuración del equipo.
ja: 選択した勤務タイプは使用できません。チーム設定を確認してください。
ko: 선택한 근무 유형을 사용할 수 없습니다. 팀 설정을 확인해주세요.
zh_hans: 所选值班类型不可用，请检查团队设置。

# duty.pattern.team.required
source: You must belong to a team to configure a default duty pattern.
es: Debes pertenecer a un equipo para configurar un patrón de turnos.
ja: 基本勤務パターンを設定するには、チームに所属する必要があります。
ko: 팀에 소속된 회원만 기본 근무 패턴을 설정할 수 있습니다.
zh_hans: 只有团队成员才能设置默认值班模式。

# duty.pattern.weekdays.duplicate
source: The same weekday cannot be configured twice.
es: No se puede configurar dos veces el mismo día.
ja: 同じ曜日を重複して設定することはできません。
ko: 같은 요일을 두 번 설정할 수 없습니다.
zh_hans: 同一星期不能重复设置。

# duty.pattern.weekdays.required
source: Select at least one workday.
es: Selecciona al menos un día de trabajo.
ja: 勤務曜日を1つ以上選択してください。
ko: 근무 요일을 하나 이상 선택해주세요.
zh_hans: 请至少选择一个工作日。

# dutyBatch.dutyTypeNotSingle
source: The team must have exactly one duty type to use batch upload.
es: El equipo debe tener exactamente un tipo de tarea para utilizar la carga por lotes.
ja: 一括アップロードを使うには、チームの勤務タイプがちょうど1つ必要です。
ko: 일괄 업로드를 사용하려면 팀의 근무 유형이 정확히 1개여야 합니다.
zh_hans: 团队必须只有一种班次类型才能使用批量上传。

# dutyBatch.member.teamRequired
source: The account must belong to a team to use batch upload.
es: La cuenta debe pertenecer a un equipo para utilizar la carga por lotes.
ja: 勤務表の一括アップロードを使うには、チーム所属アカウントである必要があります。
ko: 시간표 일괄 업로드를 사용하려면 팀에 속한 계정이어야 합니다.
zh_hans: 该帐户必须属于一个团队才能使用批量上传。

# dutyBatch.multipleNameFound
source: Multiple matching names were found in the uploaded file.
es: Se encontraron varios nombres coincidentes en el archivo subido.
ja: アップロードしたファイルで同じ名前の利用者が複数見つかりました。
ko: 업로드한 파일에서 같은 이름의 사용자가 여러 명 발견되었습니다.
zh_hans: 在上传的文件中发现多个匹配的名称。

# dutyBatch.nameNotFound
source: Could not find the member name in the uploaded file.
es: No se pudo encontrar el nombre del miembro en el archivo cargado.
ja: アップロードしたファイルから利用者名を見つけられませんでした。
ko: 업로드한 파일에서 사용자의 이름을 찾을 수 없습니다.
zh_hans: 在上传的文件中找不到会员姓名。

# dutyBatch.notSupportedFile
source: This file format is not supported. Supported formats: {supportedFile}
es: Este formato de archivo no es compatible. Formatos admitidos: {supportedFile}
ja: このファイル形式には対応していません。対応形式: {supportedFile}
ko: 지원하지 않는 파일 형식입니다. 지원 형식: {supportedFile}
zh_hans: 不支持此文件格式。支持的格式：{supportedFile}

# dutyBatch.template.required
source: Select a batch upload template first.
es: Primero seleccione una plantilla de carga por lotes.
ja: 先に一括アップロードテンプレートを選択してください。
ko: 먼저 일괄 업로드 템플릿을 선택해주세요.
zh_hans: 首先选择批量上传模板。

# dutyBatch.yearMonthNotMatch
source: The uploaded file month does not match the selected schedule month ({year}-{month}).
es: El mes del archivo cargado no coincide con el mes programado seleccionado ({year}-{month}).
ja: アップロードしたファイルの年月が選択した勤務表年月（{year}-{month}）と一致しません。
ko: 업로드한 파일의 연월이 현재 설정 중인 시간표({year}년 {month}월)와 일치하지 않습니다.
zh_hans: 上传的文件月份与选定的计划月份 ({year}-{month}) 不匹配。

# dutyType.color.invalid
source: Invalid color format.
es: Formato de color no válido.
ja: 色の形式が正しくありません。
ko: 올바른 색상 형식이 아닙니다.
zh_hans: 颜色格式无效。

# dutyType.name.duplicate
source: A duty type with the same name already exists.
es: Ya existe un tipo de turno con el mismo nombre.
ja: 同じ名前の勤務タイプがすでに存在します。
ko: 동일한 이름의 근무 유형이 이미 존재합니다.
zh_hans: 已存在同名的班次类型。

# dutyType.name.length
source: Duty names must be between 1 and 10 characters.
es: Los nombres de los turnos deben tener entre 1 y 10 caracteres.
ja: 勤務名は1文字以上10文字以下で入力してください。
ko: 근무명은 1자 이상 10자 이하로 입력해주세요.
zh_hans: 班次名称必须介于 1 到 10 个字符之间。

# dutyType.name.required
source: Duty name is required.
es: Se requiere el nombre del servicio.
ja: 勤務名は必須です。
ko: 근무명은 필수입니다.
zh_hans: 班次名称为必填项。

# friend.family.alreadyFamily
source: This member is already marked as family.
es: Este miembro ya está marcado como familia.
ja: すでに家族として設定されています。
ko: 이미 가족으로 설정된 사용자입니다.
zh_hans: 该成员已被标记为家庭成员。

# friend.family.notFamily
source: This member is not marked as family.
es: Este miembro no está marcado como familia.
ja: 家族として設定されていません。
ko: 가족으로 설정된 사용자가 아닙니다.
zh_hans: 该成员未标记为家庭成员。

# friend.family.notFriend
source: Only friends can be added as family.
es: Solo se pueden agregar amigos como familia.
ja: 家族に追加するには、先に友だちである必要があります。
ko: 가족으로 추가하려면 먼저 친구여야 합니다.
zh_hans: 只有朋友才能添加为家人。

# friend.notFriend
source: This member is not your friend.
es: Este miembro no es tu amigo.
ja: 友だちとしてつながっている相手ではありません。
ko: 친구로 연결된 사용자가 아닙니다.
zh_hans: 该成员不是您的朋友。

# friend.request.alreadyFriend
source: You are already friends.
es: Ya sois amigos.
ja: すでに友だちです。
ko: 이미 친구로 연결된 사용자입니다.
zh_hans: 你们已经是朋友了。

# friend.request.alreadyRequested
source: A friend or family request is already pending.
es: Una solicitud de amigo o familiar ya está pendiente.
ja: 保留中の友だちまたは家族リクエストがすでにあります。
ko: 이미 대기 중인 친구 또는 가족 요청이 있습니다.
zh_hans: 朋友或家人的请求已在等待处理。

# friend.request.notFound
source: No pending friend or family request was found.
es: No se encontró ninguna solicitud pendiente de amigo o familiar.
ja: 保留中の友だちまたは家族リクエストが見つかりません。
ko: 대기 중인 친구 또는 가족 요청을 찾을 수 없습니다.
zh_hans: 未找到待处理的朋友或家人请求。

# friend.request.self
source: You cannot send a friend request to yourself.
es: No puedes enviarte una solicitud de amistad a ti mismo.
ja: 自分自身には友だちリクエストを送れません。
ko: 자기 자신에게는 친구 요청을 보낼 수 없습니다.
zh_hans: 您无法向自己发送好友请求。

# member.auxiliary.name.required
source: Name is required.
es: El nombre es obligatorio.
ja: 名前は必須です。
ko: 이름은 필수입니다.
zh_hans: 姓名为必填项。

# member.visibility.forbidden
source: You do not have permission to view this member's calendar.
es: No tienes permiso para ver el calendario de este miembro.
ja: この会員のカレンダーを閲覧する権限がありません。
ko: 이 회원의 캘린더를 볼 권한이 없습니다.
zh_hans: 您无权查看该成员的日历。

# member.visibility.update.forbidden
source: You cannot update another member's visibility.
es: No puedes actualizar la visibilidad de otro miembro.
ja: 他の会員の公開範囲は変更できません。
ko: 다른 회원의 공개 범위는 변경할 수 없습니다.
zh_hans: 您无法更新其他成员的可见性。

# policy.privacy.consent.required
source: You must agree to the privacy policy.
es: Debe aceptar la política de privacidad.
ja: プライバシーポリシーへの同意が必要です。
ko: 개인정보 처리방침에 동의해야 합니다.
zh_hans: 您必须同意隐私政策。

# policy.privacy.version.required
source: Privacy policy version information is required.
es: Se requiere información de la versión de la política de privacidad.
ja: プライバシーポリシーのバージョン情報が必要です。
ko: 개인정보 처리방침 버전 정보가 필요합니다.
zh_hans: 需要隐私政策版本信息。

# policy.terms.consent.required
source: You must agree to the terms of service.
es: Debe aceptar los términos de servicio.
ja: 利用規約への同意が必要です。
ko: 서비스 이용약관에 동의해야 합니다.
zh_hans: 您必须同意服务条款。

# policy.terms.version.required
source: Terms version information is required.
es: Se requiere información sobre la versión de los términos.
ja: 利用規約のバージョン情報が必要です。
ko: 이용약관 버전 정보가 필요합니다.
zh_hans: 需要条款版本信息。

# schedule.tag.notFriend
source: Only friends can be tagged on this schedule.
es: Solo se pueden etiquetar amigos en este programa.
ja: この予定には友だちだけをタグ付けできます。
ko: 친구만 이 일정에 태그할 수 있습니다.
zh_hans: 在此时间表中只能标记朋友。

# schedule.visibility.forbidden
source: You do not have permission to view this schedule.
es: No tienes permiso para ver este programa.
ja: この予定を閲覧する権限がありません。
ko: 이 일정을 볼 권한이 없습니다.
zh_hans: 您无权查看此时间表。

# schedule.write.forbidden
source: You do not have permission to edit this schedule.
es: No tienes permiso para editar este horario.
ja: この予定を編集する権限がありません。
ko: 이 일정을 수정할 권한이 없습니다.
zh_hans: 您无权编辑此计划。

# sso.username.length
source: Usernames must be between 1 and 10 characters.
es: Los nombres de usuario deben tener entre 1 y 10 caracteres.
ja: ユーザー名は1文字以上10文字以下で入力してください。
ko: 사용자명은 1자 이상 10자 이하로 입력해주세요.
zh_hans: 用户名必须介于 1 到 10 个字符之间。

# sso.username.required
source: Username is required.
es: Se requiere nombre de usuario.
ja: ユーザー名は必須です。
ko: 사용자명은 필수입니다.
zh_hans: 需要用户名。

# sso.uuid.invalid
source: The sign-up session is invalid or has expired.
es: La sesión de registro no es válida o ha caducado.
ja: 会員登録セッションが無効か、期限切れです。
ko: 회원가입 세션이 유효하지 않거나 만료되었습니다.
zh_hans: 注册会话无效或已过期。

# sso.uuid.required
source: Sign-up session information is required.
es: Se requiere información de la sesión de registro.
ja: 会員登録セッション情報が必要です。
ko: 회원가입 세션 정보가 필요합니다.
zh_hans: 需要注册会话信息。

# team.admin.required
source: Only team admins can perform this action.
es: Solo los administradores del equipo pueden realizar esta acción.
ja: チーム管理者のみ実行できます。
ko: 팀 관리자만 이 작업을 할 수 있습니다.
zh_hans: 只有团队管理员可以执行此操作。

# team.dutyType.sameTeam.required
source: Duty types must belong to the same team.
es: Los tipos de tareas deben pertenecer al mismo equipo.
ja: 勤務タイプは同じチームに属している必要があります。
ko: 근무 유형은 같은 팀에 속해 있어야 합니다.
zh_hans: 班次类型必须属于同一团队。

# team.manage.forbidden
source: You do not have permission to manage this team.
es: No tienes permiso para administrar este equipo.
ja: このチームを管理する権限がありません。
ko: 이 팀을 관리할 권한이 없습니다.
zh_hans: 您无权管理该团队。

# team.member.alreadyAssigned
source: This member already belongs to a team.
es: Este miembro ya pertenece a un equipo.
ja: この利用者はすでに別のチームに所属しています。
ko: 이 사용자는 이미 다른 팀에 속해 있습니다.
zh_hans: 该成员已经属于一个团队。

# team.member.notInTeam
source: This member does not belong to this team.
es: Este miembro no pertenece a este equipo.
ja: この利用者はこのチームに所属していません。
ko: 이 사용자는 이 팀에 속해 있지 않습니다.
zh_hans: 该成员不属于该团队。

# team.member.required
source: You must belong to this team to access it.
es: Debes pertenecer a este equipo para acceder a él.
ja: このチームに所属している必要があります。
ko: 이 팀에 속한 사용자만 접근할 수 있습니다.
zh_hans: 您必须属于该团队才能访问它。

# todo.reorder.orderedIds.required
source: The reordered to-do ID list is required.
es: Se requiere la lista de ID de tareas pendientes reordenada.
ja: 同じ状態で並び替えるには、並び替え後のやることID一覧が必要です。
ko: 같은 상태에서 순서를 바꾸려면 정렬된 할 일 ID 목록이 필요합니다.
zh_hans: 需要重新排序的待办事项 ID 列表。

# todo.tag.notFriend
source: Only friends can be tagged on this to-do.
es: Solo se pueden etiquetar amigos en esta tarea pendiente.
ja: このTo-doには友だちだけをタグ付けできます。
ko: 친구만 이 할 일에 태그할 수 있습니다.
zh_hans: 只有朋友可以标记此待办事项。

# errors.generic
source: Something went wrong. Please try again.
es: Se ha producido un error. Inténtalo de nuevo.
ja: エラーが発生しました。もう一度お試しください。
ko: 오류가 발생했습니다. 다시 시도해주세요.
zh_hans: 发生错误。请重试。

# errors.transport
source: Unable to connect. Check your network and try again.
es: No se pudo conectar. Comprueba tu red e inténtalo de nuevo.
ja: 接続できませんでした。ネットワークを確認して、もう一度お試しください。
ko: 연결할 수 없습니다. 네트워크를 확인한 후 다시 시도해주세요.
zh_hans: 无法连接。请检查网络后重试。
